Ran Plan for dir: `demo/7-eks` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.workers-v1.aws_autoscaling_group.worker[0] has changed
~ resource "aws_autoscaling_group" "worker" {
      ~ desired_capacity          = 4 -> 2
        id                        = "eks-demo-workers-v1-2022100406503934660000001b"
        name                      = "eks-demo-workers-v1-2022100406503934660000001b"
        # (23 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # module.workers-v1.aws_autoscaling_group.worker[0] will be updated in-place
~ resource "aws_autoscaling_group" "worker" {
        id                        = "eks-demo-workers-v1-2022100406503934660000001b"
        name                      = "eks-demo-workers-v1-2022100406503934660000001b"
        # (24 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-0092ad7e60f717e9d" -> (known after apply)
            name    = "eks-demo-workers-v1-20221004070618506000000001"
            # (1 unchanged attribute hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.workers-v1.aws_launch_template.worker[0] will be destroyed
  # (because index [0] is out of range for count)
- resource "aws_launch_template" "worker" {
      - arn                                  = "arn:aws:ec2:ap-northeast-2:082867736673:launch-template/lt-0092ad7e60f717e9d" -> null
      - default_version                      = 1 -> null
      - description                          = "" -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = "true" -> null
      - id                                   = "lt-0092ad7e60f717e9d" -> null
      - image_id                             = "ami-0bdddffb8b140ef90" -> null
      - instance_initiated_shutdown_behavior = "" -> null
      - instance_type                        = "c6i.large" -> null
      - kernel_id                            = "" -> null
      - key_name                             = "bruce-seoul" -> null
      - latest_version                       = 2 -> null
      - name                                 = "eks-demo-workers-v1-20221004070618506000000001" -> null
      - name_prefix                          = "eks-demo-workers-v1-" -> null
      - ram_disk_id                          = "" -> null
      - security_group_names                 = [] -> null
      - tags                                 = {
          - "Environment"                    = "demo"
          - "KubernetesCluster"              = "eks-demo"
          - "Name"                           = "eks-demo-workers-v1"
          - "krmt.io/group"                  = "workers"
          - "krmt.io/instancegroup"          = "workers-v1"
          - "krmt.io/subgroup"               = "workers-v1"
          - "kubernetes.io/cluster/eks-demo" = "owned"
        } -> null
      - tags_all                             = {
          - "Environment"                    = "demo"
          - "KubernetesCluster"              = "eks-demo"
          - "Name"                           = "eks-demo-workers-v1"
          - "krmt.io/group"                  = "workers"
          - "krmt.io/instancegroup"          = "workers-v1"
          - "krmt.io/subgroup"               = "workers-v1"
          - "kubernetes.io/cluster/eks-demo" = "owned"
        } -> null
      - user_data                            = (sensitive) -> null
      - vpc_security_group_ids               = [] -> null

      - block_device_mappings {
          - device_name = "/dev/xvda" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 50 -> null
              - volume_type           = "gp3" -> null
            }
        }

      - iam_instance_profile {
          - name = "eks-demo-workers-v1" -> null
        }

      - monitoring {
          - enabled = true -> null
        }

      - network_interfaces {
          - associate_public_ip_address = "false" -> null
          - delete_on_termination       = "true" -> null
          - device_index                = 0 -> null
          - ipv4_address_count          = 0 -> null
          - ipv4_addresses              = [] -> null
          - ipv4_prefix_count           = 0 -> null
          - ipv4_prefixes               = [] -> null
          - ipv6_address_count          = 0 -> null
          - ipv6_addresses              = [] -> null
          - ipv6_prefix_count           = 0 -> null
          - ipv6_prefixes               = [] -> null
          - network_card_index          = 0 -> null
          - security_groups             = [
              - "sg-03abc42824ef88159",
              - "sg-07c699460cd936bb8",
            ] -> null
        }

      - tag_specifications {
          - resource_type = "instance" -> null
          - tags          = {
              - "Environment"                    = "demo"
              - "KubernetesCluster"              = "eks-demo"
              - "Name"                           = "eks-demo-workers-v1"
              - "krmt.io/group"                  = "workers"
              - "krmt.io/instancegroup"          = "workers-v1"
              - "krmt.io/subgroup"               = "workers-v1"
              - "kubernetes.io/cluster/eks-demo" = "owned"
            } -> null
        }
      - tag_specifications {
          - resource_type = "volume" -> null
          - tags          = {
              - "Environment"                    = "demo"
              - "KubernetesCluster"              = "eks-demo"
              - "Name"                           = "eks-demo-workers-v1"
              - "krmt.io/group"                  = "workers"
              - "krmt.io/instancegroup"          = "workers-v1"
              - "krmt.io/subgroup"               = "workers-v1"
              - "kubernetes.io/cluster/eks-demo" = "owned"
            } -> null
        }
    }

  # module.workers-v1.aws_launch_template.worker_spot[0] will be created
+ resource "aws_launch_template" "worker_spot" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = "true"
      + id              = (known after apply)
      + image_id        = "ami-0bdddffb8b140ef90"
      + instance_type   = "c6i.large"
      + key_name        = "bruce-seoul"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "eks-demo-workers-v1-spot-"
      + tags            = {
          + "Environment"                    = "demo"
          + "KubernetesCluster"              = "eks-demo"
          + "Name"                           = "eks-demo-workers-v1"
          + "krmt.io/group"                  = "workers"
          + "krmt.io/instancegroup"          = "workers-v1"
          + "krmt.io/subgroup"               = "workers-v1"
          + "kubernetes.io/cluster/eks-demo" = "owned"
        }
      + tags_all        = {
          + "Environment"                    = "demo"
          + "KubernetesCluster"              = "eks-demo"
          + "Name"                           = "eks-demo-workers-v1"
          + "krmt.io/group"                  = "workers"
          + "krmt.io/instancegroup"          = "workers-v1"
          + "krmt.io/subgroup"               = "workers-v1"
          + "kubernetes.io/cluster/eks-demo" = "owned"
        }
      + user_data       = (sensitive)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 50
              + volume_type           = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "eks-demo-workers-v1"
        }

      + instance_market_options {
          + market_type = "spot"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + ipv6_address_count          = 0
          + security_groups             = [
              + "sg-03abc42824ef88159",
              + "sg-07c699460cd936bb8",
            ]
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment"                    = "demo"
              + "KubernetesCluster"              = "eks-demo"
              + "Name"                           = "eks-demo-workers-v1"
              + "krmt.io/group"                  = "workers"
              + "krmt.io/instancegroup"          = "workers-v1"
              + "krmt.io/subgroup"               = "workers-v1"
              + "kubernetes.io/cluster/eks-demo" = "owned"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Environment"                    = "demo"
              + "KubernetesCluster"              = "eks-demo"
              + "Name"                           = "eks-demo-workers-v1"
              + "krmt.io/group"                  = "workers"
              + "krmt.io/instancegroup"          = "workers-v1"
              + "krmt.io/subgroup"               = "workers-v1"
              + "kubernetes.io/cluster/eks-demo" = "owned"
            }
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.


time="2022-10-11T07:26:32Z" level=info msg="Detected Terraform plan JSON file at /atlantis-data/repos/opspresso/terraform-env-demo/16/default/demo/7-eks/default.json"
time="2022-10-11T07:26:32Z" level=info msg="Starting: Extracting only cost-related params from terraform"
time="2022-10-11T07:26:33Z" level=info msg="Starting: Retrieving cloud prices to calculate costs"
time="2022-10-11T07:26:34Z" level=info msg="Output saved to /tmp/opspresso-terraform-env-demo-16/infracost-output.json"

Comment posted to GitHub

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d demo/7-eks`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.demo.nalbam.com/lock?id=opspresso%252Fterraform-env-demo%252Fdemo%252F7-eks%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d demo/7-eks`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
